colinporth/seggerF7/BSP/stm32746g_mt9d111.c
//{{{  includes
#include "stm32746g_discovery.h"
#include "stm32746g_discovery_camera.h"
//}}}
#define CAMERA_480x272_RES_X 480
#define CAMERA_480x272_RES_Y 272
#define CAMERA_VGA_RES_X     640
#define CAMERA_VGA_RES_Y     480
#define CAMERA_QVGA_RES_X    320
#define CAMERA_QVGA_RES_Y    240
#define CAMERA_QQVGA_RES_X   160
#define CAMERA_QQVGA_RES_Y   120

DCMI_HandleTypeDef hDcmiHandler;

static DMA_HandleTypeDef dmaHandler;
static uint32_t cameraCurrentResolution;

void DCMI_IRQHandler() { HAL_DCMI_IRQHandler (&hDcmiHandler); }
void DMA2_Stream1_IRQHandler() { HAL_DMA_IRQHandler (hDcmiHandler.DMA_Handle); }

//{{{
static void gpioIrqInit (DCMI_HandleTypeDef* hdcmi, void* Params) {

  __HAL_RCC_DCMI_CLK_ENABLE();
  __HAL_RCC_DMA2_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPIOG_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();

  // Configure DCMI GPIO as alternate function
  GPIO_InitTypeDef gpio_init_structure;
  gpio_init_structure.Mode = GPIO_MODE_AF_PP;
  gpio_init_structure.Pull = GPIO_PULLUP;
  gpio_init_structure.Speed = GPIO_SPEED_HIGH;
  gpio_init_structure.Alternate = GPIO_AF13_DCMI;

  gpio_init_structure.Pin = GPIO_PIN_4 | GPIO_PIN_6;
  HAL_GPIO_Init (GPIOA, &gpio_init_structure);

  gpio_init_structure.Pin = GPIO_PIN_3;
  HAL_GPIO_Init (GPIOD, &gpio_init_structure);

  gpio_init_structure.Pin = GPIO_PIN_5 | GPIO_PIN_6;
  HAL_GPIO_Init (GPIOE, &gpio_init_structure);

  gpio_init_structure.Pin = GPIO_PIN_9;
  HAL_GPIO_Init (GPIOG, &gpio_init_structure);

  gpio_init_structure.Pin = GPIO_PIN_9 | GPIO_PIN_10  | GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_14;
  HAL_GPIO_Init (GPIOH, &gpio_init_structure);

  // Associate the initialized DMA handle to the DCMI handle
  dmaHandler.Init.Channel             = DMA_CHANNEL_1;
  dmaHandler.Init.Direction           = DMA_PERIPH_TO_MEMORY;
  dmaHandler.Init.PeriphInc           = DMA_PINC_DISABLE;
  dmaHandler.Init.MemInc              = DMA_MINC_ENABLE;
  dmaHandler.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
  dmaHandler.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;
  dmaHandler.Init.Mode                = DMA_CIRCULAR;
  dmaHandler.Init.Priority            = DMA_PRIORITY_HIGH;
  dmaHandler.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
  dmaHandler.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
  dmaHandler.Init.MemBurst            = DMA_MBURST_SINGLE;
  dmaHandler.Init.PeriphBurst         = DMA_PBURST_SINGLE;
  dmaHandler.Instance = DMA2_Stream1;
  __HAL_LINKDMA (hdcmi, DMA_Handle, dmaHandler);

  // NVIC configuration for DCMI transfer complete interrupt
  HAL_NVIC_SetPriority (DCMI_IRQn, 0x0F, 0);
  HAL_NVIC_EnableIRQ (DCMI_IRQn);

  // NVIC configuration for DMA2D transfer complete interrupt
  HAL_NVIC_SetPriority (DMA2_Stream1_IRQn, 0x0F, 0);
  HAL_NVIC_EnableIRQ (DMA2_Stream1_IRQn);

  // Configure the DMA stream
  HAL_DMA_Init (hdcmi->DMA_Handle);
  }
//}}}
//{{{
static void mt9d111Init (uint16_t DeviceAddr, uint32_t resolution) {

  HAL_Delay (200);

  //  soft reset
  CAMERA_IO_Write16 (DeviceAddr, 0x65, 0xA000); // Bypass the PLL, R0x65:0 = 0xA000,
  CAMERA_IO_Write16 (DeviceAddr, 0xF0, 1); // page 1
  CAMERA_IO_Write16 (DeviceAddr, 0xC3, 0x0501); // Perform MCU reset by setting R0xC3:1 = 0x0501.
  CAMERA_IO_Write16 (DeviceAddr, 0xF0, 0); // page 0
  CAMERA_IO_Write16 (DeviceAddr, 0x0D, 0x0021); // Enable soft reset by setting R0x0D:0 = 0x0021. Bit 0 is used for the sensor core reset
  CAMERA_IO_Write16 (DeviceAddr, 0x0D, 0x0000); // Disable soft reset by setting R0x0D:0 = 0x0000.
  HAL_Delay (100);

  CAMERA_IO_Write16 (DeviceAddr, 0x07, 0x00FE); // HBLANK A = 254
  CAMERA_IO_Write16 (DeviceAddr, 0x08, 0x000C); // VBLANK A = 12
  CAMERA_IO_Write16 (DeviceAddr, 0x21, 0x8400); // Read Mode A = 15:binning 10:bothADC

  CAMERA_IO_Write16 (DeviceAddr, 0x05, 0x0204); // HBLANK B = 516
  CAMERA_IO_Write16 (DeviceAddr, 0x06, 0x0014); // VBLANK B = 20
  CAMERA_IO_Write16 (DeviceAddr, 0x20, 0x0300); // Read Mode B = 9:showBorder 8:overSized

  //  PLL - M=16,N=1,P=2   (24mhz/(N+1))*M / 2*(P+1) = 32mhz
  CAMERA_IO_Write16 (DeviceAddr, 0x66, 0x1001); // PLL Control 1 -    M:15:8 N:7:0
  CAMERA_IO_Write16 (DeviceAddr, 0x67, 0x0502); // PLL Control 2 - 0x05:15:8 P:7:0
  CAMERA_IO_Write16 (DeviceAddr, 0x65, 0xA000); // Clock CNTRL - PLL ON
  CAMERA_IO_Write16 (DeviceAddr, 0x65, 0x2000); // Clock CNTRL - USE PLL
  HAL_Delay (100);

  // page 1
  CAMERA_IO_Write16 (DeviceAddr, 0xF0, 1);
  CAMERA_IO_Write16 (DeviceAddr, 0x97, 0x0002); // output format configuration luma:chroma swap

  //{{{  sequencer
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA122); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x01); // Enter Preview: Auto Exposure = 1
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA123); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // Enter Preview: Flicker Detection = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA124); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x01); // Enter Preview: Auto White Balance = 1
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA125); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // Enter Preview: Auto Focus = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA126); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x01); // Enter Preview: Histogram = 1
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA127); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // Enter Preview: Strobe Control  = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA128); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // Enter Preview: Skip Control = 0

  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA129); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x03); // In Preview: Auto Exposure = 3
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA12A); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x02); // In Preview: Flicker Detection = 2
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA12B); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x03); // In Preview: Auto White Balance = 3
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA12C); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // In Preview: Auto Focus = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA12D); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x03); // In Preview: Histogram  = 3
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA12E); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // In Preview: Strobe Control = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA12F); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // In Preview: Skip Control = 0

  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA130); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x04); // Exit Preview: Auto Exposure = 4
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA131); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // Exit Preview: Flicker Detection = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA132); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x01); // Exit Preview: Auto White Balance = 1
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA133); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // Exit Preview: Auto Focus = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA134); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x01); // Exit Preview: Histogram = 1
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA135); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // Exit Preview: Strobe Control = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA136); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // Exit Preview: Skip Control = 0

