colinporth/seggerF7/BSP/stm32746g_mt9d111.c
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA137); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // Capture: Auto Exposure = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA138); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // Capture: Flicker Detection = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA139); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // Capture: Auto White Balance  = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA13A); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // Capture: Auto Focus = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA13B); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // Capture: Histogram = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA13C); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // Capture: Strobe Control = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA13D); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // Capture: Skip Control = 0
  //}}}
  //{{{  mode a,b params
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x270B); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x0030); // mode_config = disable jpeg A,B

  //{{{  preview MODE A
  /*
  ; Max Frame Time: 33.3333 msec
  ; Max Frame Clocks: 1316666.6 clocks (39.500 MHz)
  ; No. of ADCs: 1
  ; Skip Mode: 1x cols, 1x rows, Bin Mode: Yes
  ; Active Sensor Columns: 808 pixels / 1616 clocks
  ; Active Sensor Rows: 608 rows
  ; Horiz Blanking: 254 pixels / 508 clocks
  ; Vert Blanking: 11 rows
  ; Extra Delay: 955 clocks
  ;
  ; Actual Frame Clocks: 1316666 clocks
  ; Row Time: 53.772 usec / 2124 clocks
  ; Frame time: 33.333316 msec
  ; Frames per Sec: 30 fps
  ;
  ; Max Shutter Delay: 402
  ; 50Hz Flicker Period: 185.97 lines
  ; 60Hz Flicker Period: 154.97 lines
  */
  //}}}
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x2703); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 800);    // Output Width A  = 800
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x2705); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 600);    // Output Height A = 600
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x270F); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x001C); // Row Start A = 28
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x2711); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x003C); // Column Start A = 60
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x2713); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 1200);   // Row Height A = 1200
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x2715); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 1600);   // Column Width A = 1600
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x2717); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x0384); // Extra Delay A = 900
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x2719); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x0011); // Row Speed A = 17
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x2727); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0);      // Crop_X0 A = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x2729); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 800);    // Crop_X1 A = 800
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x272B); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0);      // Crop_Y0 A = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x272D); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 600);    // Crop_Y1 A = 600
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA743); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x02);   // Gamma and Contrast Settings A
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA77D); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x02);   // output format config A = 0x02 swap luma:chroma

  //{{{  capture MODE B
  /*
  ; Max Frame Time: 66.6667 msec
  ; Max Frame Clocks: 2633333.3 clocks (39.500 MHz)
  ; No. of ADCs: 2
  ; Skip Mode: 1x cols, 1x rows, Bin Mode: No
  ; Active Sensor Columns: 1608 pixels
  ; Active Sensor Rows: 1208 rows
  ; Horiz Blanking: 516 pixels
  ; Vert Blanking: 31 rows
  ; Extra Delay: 1697 clocks
  ;
  ; Actual Frame Clocks: 2633333 clocks
  ; Row Time: 53.772 usec / 2124 clocks
  ; Frame time: 66.666658 msec
  ; Frames per Sec: 15 fps
  ;
  ; Max Shutter Delay: 1663
  ; 50Hz Flicker Period: 185.97 lines
  ; 60Hz Flicker Period: 154.97 lines
  */
  //}}}
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x2707); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 1600);   // Output Width B  = 1600
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x2709); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 1200);   // Output Height B = 1200
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x271B); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x001C); // Row Start B = 28
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x271D); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x003C); // Column Start B = 60
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x271F); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 1200);   // Row Height B = 1200
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x2721); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 1600);   // Column Width B = 1600
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x2723); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x01A7); // Extra Delay B = 423
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x2725); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x0011); // Row Speed B = 17
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x2735); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0);      // Crop_X0 B = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x2737); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 1600);   // Crop_X1 B = 1600
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x2739); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0);      // Crop_Y0 B = 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x273B); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 1200);   // Crop_Y1 B = 1200
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA744); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x02);   // Gamma and Contrast Settings B
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA77E); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x02);   // output format config B = 0x02 swap luma:chroma
  //}}}
  //{{{  gamma tables
  // gamma table A 0 to 18
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA745); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00);  // 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA746); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x14);  // 20
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA747); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x23);  // 35
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA748); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x3A);  // 58
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA749); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x5E);  // 94
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA74A); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x76);  // 118
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA74B); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x88);  // 136
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA74C); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x96);  // 150
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA74D); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xA3);  // 163
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA74E); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xAF);  // 175
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA74F); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xBA);  // 186
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA750); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xC4);  // 196
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA751); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xCE);  // 206
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA752); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xD7);  // 215
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA753); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xE0);  // 224
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA754); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xE8);  // 232
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA755); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xF0);  // 240
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA756); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xF8);  // 248
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA757); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xFF);  // 255

  // gamma table B 0 to 18
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA758); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00);  // 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA759); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x14);  // 20
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA75A); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x23);  // 35
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA75B); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x3A);  // 58
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA75C); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x5E);  // 94
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA75D); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x76);  // 118
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA75E); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x88);  // 136
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA75F); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x96);  // 150
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA760); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xA3);  // 163
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA761); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xAF);  // 175
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA762); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xBA);  // 186
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA763); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xC4);  // 196
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA764); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xCE);  // 206
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA765); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xD7);  // 215
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA766); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xE0);  // 224
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA767); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xE8);  // 232
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA768); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xF0);  // 240
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA769); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xF8);  // 248
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA76A); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xFF);  // 255
  //}}}
  //{{{  other config
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x276D); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xE0E2); // FIFO_Conf1 A = 57570
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA76F); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xE1);   // FIFO_Conf2 A = 225
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x2774); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xE0E1); // FIFO_Conf1 B = 57569
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA776); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xE1);   // FIFO_Conf2 B = 225

  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x220B); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x0192); // Max R12 B (Shutter Delay) = 402
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA217); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x08);   // IndexTH23 = 8
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x2228); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x020F); // RowTime (msclk per)/4 = 527

