colinporth/seggerF7/BSP/stm32746g_mt9d111.c
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x222F); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x009A); // R9 Step = 94
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA408); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x24);   // search_f1_50 = 21
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA409); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x26);   // search_f2_50 = 23
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA40A); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x1D);   // search_f1_60 = 17
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA40B); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x1F);   // search_f2_60 = 19
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x2411); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x009A); // R9_Step_60 = 94
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x2413); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00B9); // R9_Step_50 = 112
  HAL_Delay (100);
  //}}}

  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA103); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x06); // Sequencer Refresh Mode
  HAL_Delay (200);
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA103); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x05); // Sequencer Refresh
  HAL_Delay (200);

  //{{{  focus init
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x90B6); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x01); // SFR GPIO suspend

  // enable GPIO0,1 as output, initial value 0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x9079); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xFC); // SFR GPIO data direction
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x9071); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // SFR GPIO data b1:0 = 0 GPIO0,1 initial 0

  // use 8bit counter clkdiv 2^(1+2)=8 -> 48mhz -> 6mhz ->> 23.7khz
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x90B0); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x01); // SFR GPIO wg_config b0 = 1 8bit counter
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x90B2); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x02); // SFR GPIO wg_clkdiv b0 = 2

  // GPIO0
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x908B); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // SFR GPIO wg_n0 = 0 infinite
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x9081); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 255);  // SFR GPIO wg_t00 = 255 initial off
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x9083); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0);    // SFR GPIO wg_t10 = 0 no on

  // GPIO1
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x908A); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // SFR GPIO wg_n1 = 0 infinite
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x9080); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0xFF); // SFR GPIO wg_t01 = 255 max initial on
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x9082); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // SFR GPIO wg_t11 = 0 no off

  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x90B5); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // SFR GPIO reset
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0x90B6); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // SFR GPIO suspend
  //}}}
  // use preview A
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA120); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x00); // Sequencer.params.mode - none
  CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA103); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x01); // Sequencer goto preview A - 800x600

  // use capture B
  //CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA120); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x02); // Sequencer.params.mode - capture video
  //CAMERA_IO_Write16 (DeviceAddr, 0xC6, 0xA103); CAMERA_IO_Write16 (DeviceAddr, 0xC8, 0x02); // Sequencer goto capture B  - 1600x1200
  }
//}}}

// external
//{{{
uint32_t BSP_CAMERA_Init (uint32_t Resolution) {

  // init camera i2c, readBack id
  CAMERA_IO_Init();
  CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xF0, 0);
  uint32_t readBack = CAMERA_IO_Read16 (CAMERA_I2C_ADDRESS_MT9D111, 0);

  gpioIrqInit (&hDcmiHandler, NULL);

  // config DCMI
  DCMI_HandleTypeDef* dcmi = &hDcmiHandler;
  dcmi->Instance = DCMI;
  dcmi->Init.CaptureRate = DCMI_CR_ALL_FRAME;
  dcmi->Init.HSPolarity = DCMI_HSPOLARITY_LOW;
  dcmi->Init.VSPolarity = DCMI_HSPOLARITY_LOW;
  dcmi->Init.SynchroMode = DCMI_SYNCHRO_HARDWARE;
  dcmi->Init.ExtendedDataMode = DCMI_EXTEND_DATA_8B;
  dcmi->Init.PCKPolarity = DCMI_PCKPOLARITY_RISING;
  HAL_DCMI_Init (dcmi);

  // 480x272 uses cropped 800x600
  if (Resolution == CAMERA_R480x272) {
    mt9d111Init (CAMERA_I2C_ADDRESS_MT9D111, CAMERA_R800x600);
    HAL_DCMI_ConfigCROP (dcmi, (800 - 480)/2, (600 - 272)/2, (480 * 2) - 1, 272 - 1);
    HAL_DCMI_EnableCROP (dcmi);
    }
  else {
    mt9d111Init (CAMERA_I2C_ADDRESS_MT9D111, Resolution);
    HAL_DCMI_DisableCROP (dcmi);
    }

  cameraCurrentResolution = Resolution;

  return readBack;
  }
//}}}

//{{{
uint32_t BSP_CAMERA_getXSize() {

  switch (cameraCurrentResolution) {
    case CAMERA_R160x120: return 160;
    case CAMERA_R320x240: return 320;
    case CAMERA_R480x272: return 480;
    case CAMERA_R640x480: return 640;
    case CAMERA_R800x600: return 800;
    case CAMERA_R1600x1200: return 1600;
    default: return 0;
    }
  }
//}}}
//{{{
uint32_t BSP_CAMERA_getYSize() {

  switch (cameraCurrentResolution) {
    case CAMERA_R160x120: return 120;
    case CAMERA_R320x240: return 240;
    case CAMERA_R480x272: return 272;
    case CAMERA_R640x480: return 280;
    case CAMERA_R800x600: return 600;
    case CAMERA_R1600x1200: return 1200;
    default: return 0;
    }
  }
//}}}

//{{{
void BSP_CAMERA_ContinuousStart (uint8_t* buff) {
  HAL_DCMI_Start_DMA (&hDcmiHandler, DCMI_MODE_CONTINUOUS, (uint32_t)buff, 
                      BSP_CAMERA_getXSize (cameraCurrentResolution) * BSP_CAMERA_getYSize (cameraCurrentResolution) / 2);
  }
//}}}
//{{{
void BSP_CAMERA_setFocus (int value) {

  CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xF0, 1);

  if (value <= 1) {
    CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC6, 0x9071); CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC8, 0x00); // SFR GPIO data b1:0 = 0 - disable GPIO1
    CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC6, 0x9081); CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC8, 255);  // SFR GPIO wg_t00 = 255 initial off
    CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC6, 0x9083); CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC8, 0);    // SFR GPIO wg_t10 = 0 no on
    }

  else {
    if (value > 254)
      value = 254;

    CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xF0, 1);
    CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC6, 0x9071); CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC8, 0x02);        // SFR GPIO data b1:0 = enable GPIO1
    CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC6, 0x9081); CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC8, 255 - value); // SFR GPIO wg_t00 pwm off
    CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC6, 0x9083); CAMERA_IO_Write16 (CAMERA_I2C_ADDRESS_MT9D111, 0xC8, value);       // SFR GPIO wg_t10 pwm on
    }
  }
//}}}

//{{{
void BSP_CAMERA_Stop() {
  HAL_DCMI_Stop (&hDcmiHandler);
  }
//}}}

void HAL_DCMI_LineEventCallback (DCMI_HandleTypeDef* hdcmi) {}
void HAL_DCMI_VsyncEventCallback (DCMI_HandleTypeDef* hdcmi) {}
void HAL_DCMI_FrameEventCallback (DCMI_HandleTypeDef* hdcmi) {}
void HAL_DCMI_ErrorCallback (DCMI_HandleTypeDef* hdcmi) {}
